#function
#   : 컴퓨터에서 특정한 기능을 수행하는 코드들의 묶음
#   : 함수의 장점
#       1)분할과 정복
#       2)코드의 재사용 -> 개발 속도 증대

#함수 정의 방법
#   def 함수명 (매개변수) :
#       수행할 명령문1
#       수행할 명령문2

#함수의 종류 : 값을 반환하는 함수, 값을 반환하지 않는 함수

#값을 반환하지 않은 함수의 예
#   -아르바이트 광고 자동 생성 함수

#값을 반환하는 함수 예
#   -체질량 지수 계산 함수

#함수의 형태
#1) 매개변수O, 반환값O
# def 함수명 (매개변수):
#     수행할 명령문
#     ...
#     return

#2) 매개변수O, 반환값X
# def 함수명 (매개변수):
#     수행할 명령문
#     ...

#3) 매개변수X, 반환값O
# def 함수명 :
#     수행할 명령문
#     ...
#     return

#4) 매개변수X, 반환값X
# def 함수명 :
#     수행할 명령문
#     ...

